{
  "portfolio": [
    {
      "cover": "/portfolio/one/Paywave-logo.png",
      "title": "Paywave",
      "description": "Paywave is a simple secure platform that simplifies invoicing for small businesses. It was built by a cross-functional team consisting of a Project Manager, UI/UX designer, a frontend developer and me, as a backend developer . Added unit tests for regression testing and to ensure software quality. Technologies used include Node.js (Typescript), PostgreSQL, Redis, Jest, Digital Ocean, Git",
      "url": "https://github.com/David-Inkheart/paywave"
    },
    {
      "cover": "/portfolio/one/ajuju.png",
      "title": "Ajuju",
      "description": "A RESTful API service that powers a Quora-like application. Encourages user interactions with features like user follows, question and answer votes. Added unit tests for regression testing and to ensure software quality. It was built using Tpyescript, NodeJS, ExpressJS, JWT, Prisma, PostgreSQL, Redis, RabbitMQ, Jest, Git, GitHub, Github Actions, Postman, Heroku",
      "url": "https://github.com/David-Inkheart/Ajuju"
    },
    {
      "cover": "/portfolio/one/files.png",
      "title": "File Manager",
      "description": "File manager backend service. A simple platform that helps with file management. Added integration tests to ensure software quality. It was built using NodeJS, ExpressJS, MongoDB, Redis, Bull, Mocha, Git, GitHub",
      "url": "https://github.com/David-Inkheart/alx-files_manager"
    },
    {
      "cover": "/portfolio/one/piechat.png",
      "title": "PieChat",
      "description": "A snack centered social media application. A unique social media platform designed to bring people together over their love for snacks and engaging conversations. It was built using NodeJS, ExpressJS, MongoDB, Mongoose, GraphQL, JWT, React, Git, GitHub",
      "url": "https://github.com/David-Inkheart/PieChat"
    },
    {
      "cover": "/portfolio/one/osbh.jpg",
      "title": "Open Source BookHub",
      "description": "OSBH is a portfolio project. It is a fullstack application that includes features like a library for resource upload and download, a blog and forum that users can interact with fully. It was built using Python, Django, Jinja2, HTML, CSS, JavaScript, Jquery, Bootstrap5, SQLite, postgreSQL, Ubuntu, OAuth, Git, GitHub, Nginx, Gunicorn, Digital Ocean",
      "url": "https://osbh-app-wnc95.ondigitalocean.app/"
    },
    {
      "cover": "/portfolio/one/hbnb.jpg",
      "title": "Holberton Bed N Breakfast",
      "description": "HBNB is a very simple clone of the popular AirBnB website to showcase skills in building a fullstack application and handling all stacks in person. The application is built using Python, Flask, SQLAlchemy, MySQL, Jinja2, HTML, CSS, JavaScript, jQuery, JSON, RESTful API, Git, GitHub, Nginx, HAproxy load balancer, Gunicorn, Ubuntu",
      "url": "https://github.com/David-Inkheart/HBNB_V4"
    },
    {
      "cover": "/portfolio/one/task.jpg",
      "title": "Task Tracker",
      "description": "A simple Task Tracker that was repeatedly built to play with and learn frontend frameworks. It was first built with React, then redone with Vue and AngularJs. A mock server was hosted on vercel and used to simulate a backend. The application is built using React, Vue, AngularJs, JavaScript, HTML, CSS, JSON, RESTful API, Git, GitHub, Vercel",
      "url": "https://vue-crash-course-dvd1tf97l-david-inkheart.vercel.app/"
    },
    {
      "cover": "/portfolio/one/unixhell.jpg",
      "title": "Simple Shell",
      "description": "I was tasked to make a copy of a simple shell. During this process, in addition to scripting, basic data structure, and algorithmic knowledge already gained, I learned more about how the shell works, and what happens when a command is typed into the command line. This was built with a knowledge of C, Processes and Signals, IO, Data structures, Algorithms, Shell Script, System call, and Linux",
      "url": "https://github.com/David-Inkheart/simple_shell"
    }
  ]
}
